%-------------------------------------------------------------------------%
%--------------------------二维动力学模型微分方程--------------------------%
%-------------------------------------------------------------------------%
function dy = Hyper_dive_Dynamitics_2D_function(t,y)

global t_u u
S=0.5026;           %参考面积
g=9.81;

%get_u
%使用非结终止条件的样条插值。在查询点插入的值基于各维中邻点网格点处数值的三次插值。
ui= interp1(t_u,u,t,'spline');

rou = 1.225*exp(-y(2)/7110);    %密度rou
q   = 0.5*rou*y(3)^2;           %动压    
M   = y(3)/340;                 %马赫数
m   = 1600;                     %质量
CL  = 0.4172+19.41*ui+10.17*ui^2-M*(0.1004+0.7536*ui);     %u为控制量：u=alpha
L   = q*CL*S;                   %升力
Cd0 = 0.3042;
Cd  = Cd0+0.02988*CL^2;         %阻力系数
D   = q*Cd*S;                   %阻力

dy=zeros(4,1);
dy(1)=-y(3)*cos(y(4));      %y（1）表示航程
dy(2)=y(3)*sin(y(4));       %y（2）表示高度
dy(3)=-D/m-g*sin(y(4));     %y（3）表示速度
dy(4)=L/(m*y(3))-(g/y(3))*cos(y(4));   %y（4）表示弹道倾角

end